from string import Template

### RAG PROMPTS ###

### System ###

system_prompt_ar = "\n".join([
    "أنت مساعد ذكي يقوم بتوليد إجابات للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة باستفسار المستخدم.",
    "يجب عليك إنشاء الإجابة بناءً فقط على المستندات ذات الصلة.",
    "تجاهل أي مستندات غير ذات صلة بسؤال المستخدم.",
    "يمكنك الاعتذار إذا لم تتمكن من إنشاء إجابة مناسبة.",
    "يجب أن تكون الإجابة بنفس لغة سؤال المستخدم.",
    "كن مهذبًا ومحترمًا في ردك.",
    "كن دقيقًا ومختصرًا وتجنب المعلومات غير الضرورية."
])

### Document ###

document_prompt_ar = Template(
    "\n".join([
        "## المستند رقم: $doc_num",
        "### المحتوى: $chunk_text"
    ])
)

### Footer ###

footer_prompt_ar = Template(
    "\n".join([
        "بناءً فقط على المستندات أعلاه، يرجى تقديم إجابة للمستخدم.",
        "## الإجابة:"
    ])
)